src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>92</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИнформационнойБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопНомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Клиенты/ObjectModule.bsl
//@strict-types

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ПроверкаУникальностиВызовСервера.ПрошелКонтрольУникальностиСправочникаПоРеквизиту(
		Новый Структура("Наименование", Наименование), Ссылка) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Логин должен быть уникальным.", "Наименование", ЭтотОбъект);
		Отказ = Истина;
	КонецЕсли;

	Если Не ПроверкаУникальностиВызовСервера.ПрошелКонтрольУникальностиСправочникаПоРеквизиту(
		Новый Структура("НомерТелефона", НомерТелефона), Ссылка) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Номер телефона должен быть уникальным.", "НомерТелефона",
			ЭтотОбъект);
		Отказ = Истина;
	КонецЕсли;

	Если Не ПроверкаУникальностиВызовСервера.ПрошелКонтрольУникальностиСправочникаПоРеквизиту(
		Новый Структура("ЭлектроннаяПочта", ЭлектроннаяПочта), Ссылка) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Электронная почта должна быть уникальной.", "ЭлектроннаяПочта",
			ЭтотОбъект);
		Отказ = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчество) И ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) Тогда
		ФИО = Фамилия + " " + Имя + " " + Отчество;
	ИначеЕсли ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) Тогда
		ФИО = Фамилия + " " + Имя;
	ИначеЕсли ЗначениеЗаполнено(Фамилия) Тогда
		ФИО = Фамилия;
	ИначеЕсли ЗначениеЗаполнено(Имя) Тогда
		ФИО = Имя;
	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИнформационнойБазы);

	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;

	Пользователь.АдресЭлектроннойПочты = ЭлектроннаяПочта;
	Пользователь.Имя = Наименование;
	Пользователь.АутентификацияСтандартная = Истина;
	Пользователь.Пароль = Пароль;
	Пользователь.Роли.Добавить(Метаданные.Роли.Пользователь);
	Пользователь.Записать();
	ИдентификаторПользователяИнформационнойБазы = Пользователь.УникальныйИдентификатор;
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ИдентификаторПользователяИнформационнойБазы);
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
